[Language]
Main_Title=Takk for at du valgte EaseUS Data Recovery Wizard
Sub_Title=Hvordan ville du vurdere din samlede erfaring?
Terrible=Fryktelig
Poor=Dårlig
Good=Flink
Great=Flott
Excellent=Utmerket
Never_Ask_Again=Aldri spør igjen
Rate_Now=Vurder nå
Feedback_Text_Tips=Vennligst gi tilbakemelding her.
Feedback_Length_Tips=Du har skrevet mer enn 500 bokstaver. Vennligst send flere tilbakemeldinger til support@easeus.com.

